{
  "kitaplar": [
    {
      "id": "1",
      "kitapAdi": "Körlük",
      "kitapYazari": "Jose Saramago",
      "kitapKategorisi": "Roman",
      "kitapSayfaSayisi": "320",
      "kitapResmi": "https://img.kitapyurdu.com/v1/getImage/fn:11857266/wh:true/wi:220",
      "kitapAciklamasi": "Usta yazarın belki de en etkileyici yapıtı olan, sinemaya da uyarlanmış Körlük, toplumsal yaşamın nasıl bir vahşete dönüşebileceğini müthiş bir incelikle gözler önüne sererken, insana dair son umut kırıntısını da bir kadının tek başına örgütlediği dayanışma ve direniş örneğiyle sergileyen unutulmaz eserler arasında yerini almıştır."
    },
    {
      "id": "2",
      "kitapAdi": "Çanlar Kimin İçin Çalıyor",
      "kitapYazari": "Ernest Hemingway",
      "kitapKategorisi": "Roman",
      "kitapSayfaSayisi": "636",
      "kitapResmi": "https://img.kitapyurdu.com/v1/getImage/fn:7672924/wh:true/wi:220",
      "kitapAciklamasi": "Çanlar Kimin İçin Çalıyor, Hemingway'in İspanya İç Savaşı'nda yaşadığı deneyimlerden esinlenerek yazdığı, savaşın insanlar üzerindeki etkilerini ve insanın insan üzerindeki etkilerini anlatan bir romanıdır."
    },
    {
      "id": "3",
      "kitapAdi": "Saatleri Ayarlama Enstitüsü",
      "kitapYazari": "Ahmet Hamdi Tanpınar",
      "kitapKategorisi": "Roman",
      "kitapSayfaSayisi": "382",
      "kitapResmi": "https://img.kitapyurdu.com/v1/getImage/fn:11085821/wh:true/wi:220",
      "kitapAciklamasi": "Saatleri Ayarlama Enstitüsü, Ahmet Hamdi Tanpınar'ın 1961 yılında yayımlanan, Türk edebiyatının en önemli eserlerinden biri kabul edilen romanıdır."
    },
    {
      "id": "4",
      "kitapAdi": "Sapiens",
      "kitapYazari": "Yuval Noah Harari",
      "kitapKategorisi": "Tarih",
      "kitapSayfaSayisi": "456",
      "kitapResmi": "https://img.kitapyurdu.com/v1/getImage/fn:1459987/wh:true/wi:220",
      "kitapAciklamasi": "Sapiens, Yuval Noah Harari'nin tarih öncesi dönemlerden günümüze kadar insanlık tarihi hakkında yazdığı bir kitaptır."
    },
    {
      "id": "5",
      "kitapAdi": "Klara ile Güneş",
      "kitapYazari": "Kazuo Ishiguro",
      "kitapKategorisi": "Roman",
      "kitapSayfaSayisi": "264",
      "kitapResmi": "https://img.kitapyurdu.com/v1/getImage/fn:11415635/wh:true/wi:220",
      "kitapAciklamasi": "Sıra dışı gözlem yeteneğine sahip bir yapay zekâ olan Klara, kendisi gibi “Yapay Arkadaş”ların satıldığı mağazadaki yerinden insanları izleyip dış dünyayı öğrenmeye çalışır, onu yeni evine götürecek o özel çocuğu sabırla bekler. O çocuk nihayet çıkageldiğinde, Klara kendini ezici kaygılar ve kırılgan umutlarla dolu bir dünyada bulacak, sarsılmaz bir adanmışlıkla bağlandığı Güneş’in yardımıyla bir mucizeyi gerçek kılmaya çalışırken insan denen canlıyı bütün zaafları ve çelişkileriyle tanıma fırsatı bulacaktır."
    },
    {
      "id": "6",
      "kitapAdi": "Simyacı",
      "kitapYazari": "Paulo Coelho",
      "kitapKategorisi": "Roman",
      "kitapSayfaSayisi": "184",
      "kitapResmi": "https://cdn.dsmcdn.com/ty521/product/media/images/20220831/21/167660045/529172064/1/1_org_zoom.jpg",
      "kitapAciklamasi": "Brezilyalı yazar Paulo Coelho'nun dünya çapında büyük bir okur kitlesine ulaşmış eseri Simyacı, Santiago adlı bir çobanın kendi kişisel menkıbesini arayış hikayesini anlatır. Bu büyülü ve felsefi roman, hayatın anlamını ve kişisel dönüşüm yolculuğunu keşfetmeye teşvik eden derin mesajlar barındırır. Santiago'nun çöllerde, piramitlerde ve kalbinde gerçekleştirdiği bu yolculuk, okuyucunun kendi hayatına dair önemli farkındalıklar kazanmasına yardımcı olur."
    },
    {
      "id": "7",
      "kitapAdi": "Dünyalılar",
      "kitapYazari": "Sayaka Murata",
      "kitapKategorisi": "Roman",
      "kitapSayfaSayisi": "216",
      "kitapResmi": "https://img.kitapyurdu.com/v1/getImage/fn:11722749/wh:true/wi:220",
      "kitapAciklamasi": "Natsuki diğer kızlar gibi değil. Bir asası ve dönüşüm aynası var. Cadı ya da uzaylı olduğunu düşünüyor. Kuzeni Yu’yla birlikte yazlarını Nagano’nun dağlarında uzak gezegenlerin hayalini kurarak geçiriyor. Korkunç bir dizi olay iki çocuğu sonsuza dek ayırınca birbirlerine söz veriyorlar: Ne olursa olsun hayatta kalınacak. Yıllar geçiyor. Natsuki bir yetişkin artık. Aseksüel kocasıyla sakin bir yaşamı var, normalmiş gibi davranarak elinden geldiğince hayatta kalmaya çalışıyor. Ancak Natsuki’nin ailesinin talepleri artıyor, arkadaşları neden hâlâ bir çocuk doğurmadığını sorguluyor ve Natsuki’nin küçüklüğünden kalan travmalar yavaş yavaş gün yüzüne çıkıyor. Nagano’ya dönmek için şehirden ayrılan Natsuki, Yu’yla yeniden bir araya gelmeye hazırlanırken aklında tek bir düşünce var: Dünyalılardan kaçmak mümkün mü?"
    },
    {
      "id": "8",
      "kitapAdi": "Zengin Baba Yoksul Baba",
      "kitapYazari": "Robert T. Kiyosaki",
      "kitapKategorisi": "Finans",
      "kitapSayfaSayisi": "400",
      "kitapResmi": "https://img.kitapyurdu.com/v1/getImage/fn:11855745/wh:true/wi:256",
      "kitapAciklamasi": "Özellikle teknolojinin, robotların ve global bir ekonominin kuralları değiştirdiği bir dünyada, zengin olmak için yüksek gelirinizin olması gerektiği efsanesini çürütür.Aktif yatırımlar edinmenin ve oluşturmanın neden yüklü bir maaştan daha önemli olabileceğini, işletme sahiplerinin ve yatırımcıların keyfini sürdüğü vergi avantajlarını öğretir. Evinizin aktif bir yatırım olduğuna karşı meydan okur; emlak balonu patladığında ve yüksek faizli mortgage fiyaskosu şiddetlendiği zaman milyonlarca insanın doğrudan öğrendiği gibi.Bize okul sistemlerinin parayla ilgili öğrettiklerine neden güvenmememiz gerektiğini hatırlatır ve bu önemli yeteneğin neden bugün hiç olmadığı kadar önemli olduğunu açıklar.Çocuklarınıza paraya dair neler öğretmeniz gerektiğini açıklar, böylece onlar da günümüz dünyasının zorluklarına ve fırsatlarına kendilerini hazırlayabilir ve hak ettikleri zengin yaşamı sürebilir."
    },
    {
      "id": "9",
      "kitapAdi": "Zengin Baba Yoksul Baba",
      "kitapYazari": "Robert T. Kiyosaki",
      "kitapKategorisi": "Finans",
      "kitapSayfaSayisi": "400",
      "kitapResmi": "https://img.kitapyurdu.com/v1/getImage/fn:11855745/wh:true/wi:256",
      "kitapAciklamasi": "Özellikle teknolojinin, robotların ve global bir ekonominin kuralları değiştirdiği bir dünyada, zengin olmak için yüksek gelirinizin olması gerektiği efsanesini çürütür.Aktif yatırımlar edinmenin ve oluşturmanın neden yüklü bir maaştan daha önemli olabileceğini, işletme sahiplerinin ve yatırımcıların keyfini sürdüğü vergi avantajlarını öğretir. Evinizin aktif bir yatırım olduğuna karşı meydan okur; emlak balonu patladığında ve yüksek faizli mortgage fiyaskosu şiddetlendiği zaman milyonlarca insanın doğrudan öğrendiği gibi.Bize okul sistemlerinin parayla ilgili öğrettiklerine neden güvenmememiz gerektiğini hatırlatır ve bu önemli yeteneğin neden bugün hiç olmadığı kadar önemli olduğunu açıklar.Çocuklarınıza paraya dair neler öğretmeniz gerektiğini açıklar, böylece onlar da günümüz dünyasının zorluklarına ve fırsatlarına kendilerini hazırlayabilir ve hak ettikleri zengin yaşamı sürebilir."
    },
    {
      "id": "10",
      "kitapAdi": "Dakikalar İçinde Atatürk ve Dünyası:Askeri, Siyasi ve Özel Hayatı",
      "kitapYazari": "Prof.Dr.İlber Ortaylı",
      "kitapKategorisi": "Tarih",
      "kitapSayfaSayisi": "352",
      "kitapResmi": "https://img.kitapyurdu.com/v1/getImage/fn:11388888/wh:true/wi:220",
      "kitapAciklamasi": "Cumhuriyet’in kurucusu Gazi Mustafa Kemal Atatürk’ün doğumundan yetiştiği Selanik kentine, ailesine, askerlik yaşamına, özel hayatına, Millî Mücadele’ye; İnönü Muharebelerine, Büyük Taarruz’a, Cumhuriyet’in kuruluşuna, Lozan ve Montreux’ye, çok partili hayata geçiş dönemine, devrimlere, Atatürk’ün kitap sevgisine, çocuklarla ilişkisine ve ölümüne kadar yaşamının her yönüyle inceliyor. Bunların yanında İsmet İnönü, Fevzi Çakmak, Kâzım Karabekir, Rauf Orbay, Ali Fuat Cebesoy, Halide Edip Adıvar, Ayşe Afet İnan, Celal Bayar, Börekçizâde Rifat Hoca gibi siyasetten sanata, edebiyata, askerliğe, musikiye kadar etrafındaki isimlerle ilişkilerini ele alıyor.Dakikalar İçinde Atatürk ve Dünyası, Osmanlı’nın son dönemini ve Cumhuriyet’in ilk yarısını merkeze Kurucu Önder Gazi Mustafa Kemal Atatürk’ü alarak konulara göre özel seçilmiş görseller eşliğinde sunuyor."
    },
    {
      "id": "11",
      "kitapAdi": "Aşkın Halleri:İkili İlişkilere Farklı Bir Bakış",
      "kitapYazari": "Alper Hasanoğlu",
      "kitapKategorisi": "Diğer",
      "kitapSayfaSayisi": "216",
      "kitapResmi": "https://img.kitapyurdu.com/v1/getImage/fn:11536606/wh:true/wi:220",
      "kitapAciklamasi": "Psikiyatr ve psikoterapist Dr. Alper Hasanoğlu Aşkın Halleri’nde insan ilişkilerini aşk üzerinden değerlendiriyor.İlişkilerin gelişimi artırıcı etkisi, en net haliyle aşk ilişkisinde görülür.Bir insanın kişisel bakımdan gelişebilmesi, uzlaşmacı ve gelişime açık ötekileri bulabilmesiyle mümkündür.Bütün insani ilişki ve karşılaşmalar, uzlaşmanın mümkün olduğu bir zeminde gerçekleşir.Bir ilişkiye girmek ve bu ilişkiyi sürdürmek isteyen, ötekinin ilgilerini kendi ilgisi haline getirebilmelidir.Erkek çoğunlukla kariyer ve gelir olarak kendisinden geride olan kadınlarla birlikte olmak ister.Eşinin iyi bir sosyal statüde olması kadını narsistik olarak tatmin eder, erkeğiyse narsistik olarak yaralar.Alper Hasanoğlu, psikoterapi bilgisi yanında, sosyoloji, antropoloji ve felsefeden, ayrıca mitoloji ve edebiyattan yararlanarak iki insan arasındaki ilişkinin nasıl başladığını, olgunlaştığını ve bittiğini anlatıyor. İlişkilerin dinamiğinin ardından aile kurumunun insanlık tarihi boyunca nasıl bir değişim gösterdiğini de birçok çerçeveden gözler önüne seriyor."
    },
    {
      "id": "12",
      "kitapAdi": "Bootstrap 4-Responsive Tasarım Teknikleri ve Front-End Toolkit’leri",
      "kitapYazari": "Uğur Gelişken",
      "kitapKategorisi": "Yazılım",
      "kitapSayfaSayisi": "280",
      "kitapResmi": "https://img.kitapyurdu.com/v1/getImage/fn:11536606/wh:true/wi:220",
      "kitapAciklamasi": "“İlk Önce Mobil” sloganı ile üretilmiş olan JavaScript ve CSS birleşimi olan melez bir Framework olan Bootstrap, günümüzde neredeyse yeni nesil bütün web sayfalarının tasarımlarında ve hybrid olarak üretilen mobil uygulamaların arayüz tasarımında, geliştiricilerinin de iş yükünü hafifletmektedir.Kitap, Bootstap v4 sürümünü bütün yönleriyle uygulamalı olarak ele almıştır. Genel olarak tipografi, grid sistemi, bileşenler, bileşenlerin jQuery ile kullanımı, CSS ile ortak kullanımları ve daha birçok özellik uygulamalı olarak işlenmiştir. Ayrıca, yeni nesil Frond-end Toolkit’ler dediğimiz Node.js tabanlı çalışan npm paket yöneticisi ve Grunt görev yöneticisi de uygulamalı olarak ele alınmış, şu an sektörde en çok ihtiyaç duyacağınız uygulama örnekleri (proje oluşturma, sürüm notları, dosya değişikliği izleme, real-time yansıtma, yedekleme, SASS derleme, HTML, JS ve CSS dosyalarını minimize etme, dosya birleştirme gibi) de video destekli olarak anlatılmıştır. Kitapta edineceğiniz bilgilerle, responsive (duyarlı) web arayüzü geliştirme kendinizi geliştirmiş olacaksınız."
    }
  ],
  "kategoriler": [
    {
      "id": "0",
      "kategoriAdi": "Tüm Kitaplar"
    },
    {
      "id": "1",
      "kategoriAdi": "Roman"
    },
    {
      "id": "2",
      "kategoriAdi": "Tarih"
    },
    {
      "id": "3",
      "kategoriAdi": "Yazılım"
    },
    {
      "id": "4",
      "kategoriAdi": "Finans"
    },
    {
      "id": "5",
      "kategoriAdi": "Diğer"
    }
  ]
}
